<details ><summary>plan for eks 2025-12-15 15:54:39 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-west-3:258106547593:access-entry/bluejeay-lab-eks/user/258106547593/kv.aws@jeay.io/becd8df4-83cb-5094-9df2-262910f76f6a" -> (known after apply)
      ~ created_at        = "2025-12-14T08:10:15Z" -> (known after apply)
      ~ id                = "bluejeay-lab-eks:arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-12-14T08:10:15Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> "arn:aws:iam::258106547593:user/ci" # forces replacement
      - tags              = {} -> null
      ~ user_name         = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-12-14 08:10:16.084 +0000 UTC" -> (known after apply)
      ~ id            = "bluejeay-lab-eks#arn:aws:iam::258106547593:user/kv.aws@jeay.io#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-12-14 08:10:16.084 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> "arn:aws:iam::258106547593:user/ci" # forces replacement
        # (3 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "9b6d4c26-5cde-4ddf-8d5c-a05407eb87f8"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::258106547593:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> "arn:aws:iam::258106547593:user/ci"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::258106547593:role/bluejeay-lab-eks-cluster-20251214080020692400000009"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |                                   RESOURCE                                   |
|----------|------------------------------------------------------------------------------|
| update   | `module.eks.module.kms.aws_kms_key.this[0]`                                  |
| recreate | `module.eks.aws_eks_access_entry.this["cluster_creator"]`                    |
|          | `module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p eks
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>